<?php
 /**
 +------------------------------------------------------------------------------
 * STAFF控制類
 +------------------------------------------------------------------------------
 * @author    david <lhdst@163.com>
 * @version   $Id$
 +------------------------------------------------------------------------------
 */
class StaffAction extends Action {
	/**
	 +----------------------------------------------------------
	 * 根据查询条件显示月嫂列表
	 +----------------------------------------------------------
	 * @access public
	 +----------------------------------------------------------
	 */
	public function index() {
		//根据URL参数查询用户
		import("@.ORG.Page");
		//导入分页类
		$keyword = $_GET['name'];
		$M = D("StaffView");
		
		$count = count($M->count());
		//分页
		$p = new Page($count, 10);
		$page = $p -> show();
		$list = $M ->limit($p -> firstRow.','.$p -> listRows)->select();
		$this -> assign('page', $page);
		$this -> assign('list', $list);
		$this -> display();
	}
	/**
	 +----------------------------------------------------------
	 * 月嫂详细资料
	 +----------------------------------------------------------
	 * @access public
	 +----------------------------------------------------------
	 */
	public function viewStaff()
	{
		$this->display();
	}
}
?>